Revit 2024 API
DGNImportOptions Constructor
Overload List
Name | Description
DGNImportOptions()
 Constructs a new instance of DGNImportOptions with default values of all properties.
DGNImportOptions(DGNImportOptions)
 Constructs a new instance of DGNImportOptions as a copy of the import options.
See Also
DGNImportOptions Class
DGNImportOptions Members
Autodesk.Revit.DB Namespace